; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph4 - mode
	infrared2 - mode
	spectrograph7 - mode
	spectrograph1 - mode
	image3 - mode
	infrared6 - mode
	spectrograph0 - mode
	spectrograph5 - mode
	GroundStation2 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star3 - direction
	Star1 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph7)
	(supports instrument0 infrared6)
	(supports instrument0 image3)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared6)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph7)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 infrared6)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument4 spectrograph4)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star1)
	(supports instrument5 spectrograph4)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 spectrograph5)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument7 infrared6)
	(supports instrument7 spectrograph7)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 Star3)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared6)
	(supports instrument8 spectrograph7)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 Star3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 Star11)
	(pointing satellite2 Planet9)
	(pointing satellite3 GroundStation5)
	(have_image Planet6 spectrograph1)
	(have_image Planet6 spectrograph7)
	(have_image Phenomenon7 infrared6)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 image3)
	(have_image Star8 spectrograph7)
	(have_image Planet9 infrared6)
	(have_image Star10 spectrograph1)
	(have_image Star10 spectrograph5)
	(have_image Star11 spectrograph4)
	(have_image Star11 spectrograph0)
))

)

; plan
1. (turn_to satellite3 groundstation5 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 groundstation5)
   goals met: 1 of 15
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 15
3. (calibrate satellite3 instrument6 groundstation5)
   added: (calibrated instrument6)
   goals met: 1 of 15
4. (turn_to satellite3 star11 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 star11)
   goals met: 0 of 15
5. (take_image satellite3 star11 instrument6 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 1 of 15
6. (turn_to satellite3 star10 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star10)
   goals met: 1 of 15
7. (turn_to satellite1 groundstation4 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 15
8. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   goals met: 2 of 15
9. (take_image satellite3 star10 instrument6 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 3 of 15
10. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 3 of 15
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 15
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 15
13. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 3 of 15
14. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 3 of 15
15. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 15
16. (turn_to satellite0 planet6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet6)
   goals met: 2 of 15
17. (take_image satellite0 planet6 instrument0 spectrograph7)
   added: (have_image planet6 spectrograph7)
   goals met: 3 of 15
18. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 3 of 15
19. (take_image satellite0 planet9 instrument0 infrared6)
   added: (have_image planet9 infrared6)
   goals met: 4 of 15
20. (turn_to satellite0 star8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star8)
   goals met: 4 of 15
21. (take_image satellite0 star8 instrument0 image3)
   added: (have_image star8 image3)
   goals met: 5 of 15
22. (take_image satellite0 star8 instrument0 spectrograph7)
   added: (have_image star8 spectrograph7)
   goals met: 6 of 15
23. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   goals met: 7 of 15
24. (turn_to satellite1 phenomenon7 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon7)
   goals met: 7 of 15
25. (take_image satellite1 phenomenon7 instrument3 infrared6)
   added: (have_image phenomenon7 infrared6)
   goals met: 8 of 15
26. (take_image satellite1 phenomenon7 instrument3 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 9 of 15
27. (turn_to satellite1 planet6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet6)
   goals met: 9 of 15
28. (take_image satellite1 planet6 instrument3 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 10 of 15
29. (turn_to satellite1 star10 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star10)
   goals met: 10 of 15
30. (take_image satellite1 star10 instrument3 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 11 of 15
31. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 12 of 15
32. (turn_to satellite2 star11 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star11)
   goals met: 12 of 15
33. (take_image satellite2 star11 instrument4 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 13 of 15
34. (turn_to satellite2 planet9 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet9)
   goals met: 14 of 15
35. (turn_to satellite3 groundstation5 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 groundstation5)
   goals met: 15 of 15
